InformationRegisters/ТабельРаботыПромоутеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТабельРаботыПромоутеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаСотрудника</Name>
					<Comment>ЦФО к которому привязан сотрудник через Помощника ТУ/ТУ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналИзмененияТабелей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЖурналИзмененияТабелей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсутствие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтсутствия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойствоПродавца</Name>
					<Comment>0 - Полный, 1 - Частичный, 2 - Старший продавец, 3 - Практикант, 4 - Стажер, 5 - Ночной почасовик, 6 - Старший ночной почасовик</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Comment>Время работы почасовика (в часах), используется для магазинов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тренинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭкстренныйВызов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаСотрудника</Name>
					<Comment>ЦФО к которому привязан сотрудник через Помощника ТУ/ТУ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТабеля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаТабеля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзмененияСделаныСМагазина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТабельРаботыПромоутеров/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	//+++АК mika 2018.10.19 ИП-00019964 
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	
	//---АК mika

	//mind 2017-09-12 запишем изменения в лог
	СтруктураОтбор = Новый Структура;
	Для Каждого ЭлементОтбор Из ЭтотОбъект.Отбор Цикл
		Если ЭлементОтбор.Использование Тогда
			СтруктураОтбор.Вставить(ЭлементОтбор.Имя, ЭлементОтбор.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	Если СтруктураОтбор.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ * ИЗ РегистрСведений." + ЭтотОбъект.Метаданные().Имя + " КАК Таб
		|ГДЕ
		|	ИСТИНА";
		
		Для Каждого ЭлементОтбор Из СтруктураОтбор Цикл
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "И " + ЭлементОтбор.Ключ + " = &Параметр" + ЭлементОтбор.Ключ;
			Запрос.УстановитьПараметр("Параметр" + ЭлементОтбор.Ключ, ЭлементОтбор.Значение);
		КонецЦикла;	
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.ЖурналИзмененияТабелей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Период 			= ТекущаяДата();
			Запись.ДатаТабеля 		= Выборка.Период;
			Запись.АвторИзменений 	= ПараметрыСеанса.ТекущийПользователь;
			Запись.ТипДействия 		= "Удаление";
			Запись.ТипТабеля 		= "Промоутеры";
			Попытка
				Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПродавец) Тогда
					Запись.ИзмененияСделаныСМагазина = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
				КонецЕсли;	
			Исключение
			КонецПопытки;
			Запись.Записать();
		КонецЦикла;	
	КонецЕсли;
	
	//+++АК mika 2018.07.29 БезЗадачи. Запрет записи с незаполненной групой сотрудника (переписка со Скворцовы от 28.07.2018)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.ГруппаСотрудника) Тогда
			Сообщить(СтрЗаменить(СтрЗаменить("По записи с сотрудником ТекущийСотрудник от ТекущийПериод не указана Группа сотрудника!
											 |(Проверьте корректность привязки: Сотрудник → Помощник ТУ  → РольПомощника  → РольУправляющего (для группы развития + Родитель)  → Управляющий  → Пользователи по ЦФО → ЦФО)
											 |", 
											 "ТекущийСотрудник", Запись.Сотрудник), "ТекущийПериод", Формат(Запись.Период, "ДФ=dd.MM.yyyy")));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	//---АК mika 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//+++АК mika 2018.10.19 ИП-00019964 
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	
	//---АК mika

	//mind 2017-09-12 запишем изменения в лог
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Запись = РегистрыСведений.ЖурналИзмененияТабелей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ЗаписьНабора);
		Запись.Период 			= ТекущаяДата() + 1;
		Запись.ДатаТабеля 		= ЗаписьНабора.Период;
		Запись.АвторИзменений 	= ПараметрыСеанса.ТекущийПользователь;
		Запись.ТипДействия 		= "Добавление";
		Запись.ТипТабеля 		= "Промоутеры";
		Попытка
			Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПродавец) Тогда
				Запись.ИзмененияСделаныСМагазина = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
			КонецЕсли;	
		Исключение
		КонецПопытки;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры
